# Pandas

#Pandas in python is an import python library for Analysis and data Manipulation, 

features are: fast, powerful ,easy to use, reliable, free source and contains data manipulation tools which makes it easy to use.

Pandas are two type:

Pandas.Series([])----1 ndim or 1 vector
Pandas.DataFrame([])----2 ndim

In [1]:
a=pd.series([12,13,14,15,16])
a

NameError: name 'pd' is not defined

In [2]:
# working with Pandas Series:

a=pandas.Series([12,13,14,15,16])
a

NameError: name 'pandas' is not defined

In [3]:
#it important to call pandas library first before use---> import pandas

In [4]:
# calling pandas library.

import pandas as pd

In [6]:
# working with Pandas Series:

a=pd.Series([12,13,14,15,16])
a

0    12
1    13
2    14
3    15
4    16
dtype: int64

In [8]:
# working with Pandas Series:

b=pd.Series([12,13,14,15,16])
b

0    12
1    13
2    14
3    15
4    16
dtype: int64

In [9]:
c=a*b

In [10]:
c

0    144
1    169
2    196
3    225
4    256
dtype: int64

In [12]:
c=pd.Series([12,13,14,15,16],index=[1,2,3,4,5],)

# here we can change the index for values

c

1    12
2    13
3    14
4    15
5    16
dtype: int64

In [14]:
# Changing index and data type.

ps=pd.Series([11,12,13,14,15,16],index=[1,2,3,4,12,8],dtype=float)

In [15]:
ps

1     11.0
2     12.0
3     13.0
4     14.0
12    15.0
8     16.0
dtype: float64

In [16]:
ps.size

6

In [17]:
ps.shape

(6,)

In [18]:
ps.dtype

dtype('float64')

In [19]:
ps.itemsize #cant check item size with pd.Series

AttributeError: 'Series' object has no attribute 'itemsize'

In [20]:
s=[10,11,13,14,15,16,17]

In [21]:
# convrting list into Series

m=pd.Series(s)

In [22]:
m

0    10
1    11
2    13
3    14
4    15
5    16
6    17
dtype: int64

In [23]:
# retrieving first three elements from m

print(m[0:3])

0    10
1    11
2    13
dtype: int64

In [24]:
s=(10,11,13,14,15,16,17)

In [26]:
n=pd.Series(s)

In [27]:
n

0    10
1    11
2    13
3    14
4    15
5    16
6    17
dtype: int64

In [28]:
print(n[1:5])

1    11
2    13
3    14
4    15
dtype: int64

### passing data from DICT

In [30]:
demodict={'Name':['ABC','BCD','CDE'],'Age':[12,15,18]}

In [31]:
b=pd.Series(demodict)

In [32]:
b

Name    [ABC, BCD, CDE]
Age        [12, 15, 18]
dtype: object

In [33]:
tesdict={'Cricketer_Name':['Sachin','Dhoni','Sehwag'],'Cricket_Run' :[10,13,14]}

In [34]:
c=pd.Series(tesdict)

In [35]:
c

Cricketer_Name    [Sachin, Dhoni, Sehwag]
Cricket_Run                  [10, 13, 14]
dtype: object

# DATA FRAME:

#ABOUT Data Frame

"""
It is a two dimentional data structure, data is alligned in tubler fashion in rows and column

Features:-

>Columns are of different type.
>>Size-Mutable
>>>Labeled axes(rows and columns)

>>Can perform Arithmetic operations on rows and columns
>>> Can work on int,char,boolean,float but numpy WORKS only number

Pandas.DataFrame can be created by using following constructor-

>pandas.DataFrame(data,index,columns,dtype,copy)

"""

In [3]:
import pandas as pd

In [4]:
# performing list operation

data= [1,2,3,4]
# pandas.DataFrame(data,index,columns,dtype,copy)
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

In [7]:
data=[1,12,14,1,19,90]

df=pd.DataFrame(data, dtype=float)

In [8]:
df

      0
0   1.0
1  12.0
2  14.0
3   1.0
4  19.0
5  90.0

In [9]:
# framing list under list operation

data=[['Alex',23],['Bob',45],['Clarke',13]]

df=pd.DataFrame(data)

In [10]:
df

        0   1
0    Alex  23
1     Bob  45
2  Clarke  13

In [11]:
data=[['Alex',23],['Bob',45],['clarke',31]]

df=pd.DataFrame(data,columns=['Names','Age'])

print(df)

    Names  Age
0    Alex   23
1     Bob   45
2  clarke   31

In [14]:
data=[['Alex',10],['Bob',12],['Clark',13]]
# pandas.DataFrame(data,index,columns,dtype,copy)
df=pd.DataFrame(data,index=['Row 1','Row 2','Row 3'],dtype=int)

C:\Users\jitsa\AppData\Local\Temp\ipykernel_15604\3318341164.py:3: FutureWarning: Could not cast to int32, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(data,index=['Row 1','Row 2','Row 3'],dtype=int)

In [15]:
df

           0   1
Row 1   Alex  10
Row 2    Bob  12
Row 3  Clark  13

In [17]:
import warnings 
warnings.filterwarnings('ignore')

In [18]:
data=[['Alex',10],['Bob',12],['Clark',13]]
# pandas.DataFrame(data,index,columns,dtype,copy)
df=pd.DataFrame(data,index=['Row 1','Row 2','Row 3'],dtype=int)

In [19]:
df

           0   1
Row 1   Alex  10
Row 2    Bob  12
Row 3  Clark  13

In [20]:
data={'Name':['Raj','Tom','Jack','Harry'],'Age':[28,34,29,42]}

df=pd.DataFrame(data)

In [21]:
df #dict we get the coloumn name directly

    Name  Age
0    Raj   28
1    Tom   34
2   Jack   29
3  Harry   42

In [22]:
# Note- Observe, NAN (Not a Number) is appended  in missing areas.

data=[{'a':1,'b':2},{'a':5,'b':6,'c':7}]

df=pd.DataFrame(data)

In [23]:
df # a,b in dic1, dic2=a,b,c.... no value in c dic1 so nan is assigned by system

   a  b    c
0  1  2  NaN
1  5  6  7.0

In [25]:
data=[{'a':1,'b':2},{'a':3,'c':9}]

df=pd.DataFrame(data,index=['Dict 1','Dict 2'],dtype=float)
df

          a    b    c
Dict 1  1.0  2.0  NaN
Dict 2  3.0  NaN  9.0

In [30]:
data=[{'a':1,'b':2},{'a':5,'b':20,'c':30}]

df=pd.DataFrame(data,index=['Dict1','Dict2'],columns=['col 1','col 2','col 3'],dtype=float)

In [31]:
df # rename of column is not allowed,

       col 1  col 2  col 3
Dict1    NaN    NaN    NaN
Dict2    NaN    NaN    NaN

In [36]:
data=[{'a':1,'b':2},{'a':5,'b':20,'c':30}]

df=pd.DataFrame(data,index=['Dict1','Dict2'],columns=['a','b1','b'],dtype=float)

In [38]:
df # it can only display whats in columns, other values will be nan

         a  b1     b
Dict1  1.0 NaN   2.0
Dict2  5.0 NaN  20.0

In [1]:
import pandas as pd

In [2]:
data=[12,13,14,15,16]

In [3]:
a=pd.Series(data, index=[12,13,14,15,16],dtype=float)

In [4]:
a

12    12.0
13    13.0
14    14.0
15    15.0
16    16.0
dtype: float64

In [5]:
a.dtype

dtype('float64')

In [6]:
a.data

AttributeError: 'Series' object has no attribute 'data'

In [7]:
a.size

5

In [8]:
a.shape

(5,)

In [9]:
a.ndim

1

In [10]:
a.max()

16.0

In [11]:
a.min()

12.0

In [12]:
a.count()

5

AttributeError: 'Series' object has no attribute 'avg'

In [16]:
data={'Bucket 1':[1,2,3,4],'Bucket 2':[5,6,7,8],'Bucket 3':[9,10,11,12]}

n=pd.DataFrame(data,dtype=int)

In [17]:
n

   Bucket 1  Bucket 2  Bucket 3
0         1         5         9
1         2         6        10
2         3         7        11
3         4         8        12

In [23]:
data={'Bucket 1':[1,2,3,4],'Bucket 2':[5,6,7,8],'Bucket 3':[9,10,11,12]}

n=pd.DataFrame(data,dtype=int )

In [24]:
n

   Bucket 1  Bucket 2  Bucket 3
0         1         5         9
1         2         6        10
2         3         7        11
3         4         8        12

In [25]:
data={'Name':['Raj','Syam','Pankit'],'Age':[35,25,28],'Depatmrnt':['Hr','Sales','It']}

In [27]:
df=pd.DataFrame(data,index=['ro1','ro2','ro3'],dtype=float)

C:\Users\jitsa\AppData\Local\Temp\ipykernel_5644\908560889.py:1: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(data,index=['ro1','ro2','ro3'],dtype=float)

In [28]:
df

       Name   Age Depatmrnt
ro1     Raj  35.0        Hr
ro2    Syam  25.0     Sales
ro3  Pankit  28.0        It

In [29]:
import warnings
warnings.filterwarnings('ignore')

# INDEXing and slicing in Pandas

"""
slicing in pandas:

> df.iloc------------> index location wise search
> df.loc -----> location wise search. all rows nd column will be displayed
"""

In [32]:
import pandas as pd
import numpy as np

In [37]:
# by numpy methord

np.random.random([4,4])

array([[0.87044927, 0.35150609, 0.68611715, 0.50161471],
       [0.83212127, 0.64160261, 0.18467854, 0.37101219],
       [0.88308852, 0.50049394, 0.52471815, 0.46327662],
       [0.38234326, 0.73727324, 0.49869178, 0.43383209]])

In [38]:
# calling pandas methord

df=pd.DataFrame(np.random.random ([8,4]),columns=['A','B','C','D'])

In [39]:
df

          A         B         C         D
0  0.126458  0.932014  0.286587  0.052375
1  0.564842  0.369152  0.039909  0.719222
2  0.548031  0.497779  0.411054  0.743457
3  0.437800  0.205898  0.261159  0.528610
4  0.414964  0.072173  0.306513  0.915612
5  0.960008  0.215483  0.974432  0.133724
6  0.540042  0.687787  0.831342  0.764904
7  0.002237  0.197632  0.595404  0.370448

In [42]:
 df.loc[0:5,'A']

0    0.126458
1    0.564842
2    0.548031
3    0.437800
4    0.414964
5    0.960008
Name: A, dtype: float64

In [44]:
df.loc[4:6,'C':'D']

          C         D
4  0.306513  0.915612
5  0.974432  0.133724
6  0.831342  0.764904

In [45]:
df.iloc[0:5,0]

0    0.126458
1    0.564842
2    0.548031
3    0.437800
4    0.414964
Name: A, dtype: float64

df.iloc[0:5,'A'] # no column name is supported here @ iloc operation

In [47]:
df=pd.DataFrame(np.random.randn(4,4))

In [48]:
df

          0         1         2         3
0  0.308083  0.712733 -0.237226  0.562532
1 -0.783357  0.805409  0.009147  0.883212
2  1.332709  0.129314  0.681156 -1.203609
3  1.193692 -1.065226  1.561010  1.322264

In [58]:
df1=pd.DataFrame(np.random.rand(4,8),columns=['A','B','C','D','E','F','G','H'])

In [59]:
df1

,A,B,C,D,E,F,G,H
0,0.914865,0.103409,0.127173,0.163749,0.341505,0.392015,0.604620,0.588637
1,0.824123,0.866219,0.254675,0.480098,0.542215,0.471292,0.958993,0.918338
2,0.899461,0.183734,0.456234,0.254755,0.835873,0.813397,0.323560,0.321770
3,0.508158,0.724020,0.899918,0.241160,0.387258,0.367008,0.929747,0.886965

In [60]:
df1.iloc[:,2:]

          C         D         E         F         G         H
0  0.127173  0.163749  0.341505  0.392015  0.604620  0.588637
1  0.254675  0.480098  0.542215  0.471292  0.958993  0.918338
2  0.456234  0.254755  0.835873  0.813397  0.323560  0.321770
3  0.899918  0.241160  0.387258  0.367008  0.929747  0.886965

In [62]:
df1.loc[0:3,'C':'D']

          C         D
0  0.127173  0.163749
1  0.254675  0.480098
2  0.456234  0.254755
3  0.899918  0.241160

-------------------------------------------------------------------------------